In [ ]:
import numpy as np
import pandas as pd

pd.set_option("display.max.columns", 100)
# to draw pictures in jupyter notebook
% matplotlib inline
# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings

import matplotlib.pyplot as plt
import seaborn as sns

warnings.filterwarnings("ignore")

In [2]:
# for Jupyter-book, we copy data from GitHub, locally, to save Internet traffic,
# you can specify the data/ folder from the root of your cloned
# https://github.com/Yorko/mlcourse.ai repo, to save Internet traffic
DATA_URL = "https://raw.githubusercontent.com/Yorko/mlcourse.ai/master/data/"

In [3]:
data = pd.read_csv(DATA_URL + "adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

1. Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?

In [6]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

2. Каков средний возраст (признак age) женщин? *

In [7]:
data[data['sex'] == 'Female']['age'].mean()

36.85823043357163

3. Какова доля граждан Германии (признак native-country) в процентах? *

In [9]:
data['native-country'].value_counts(normalize=True)

United-States                 0.895857
Mexico                        0.019748
?                             0.017905
Philippines                   0.006081
Germany                       0.004207
Canada                        0.003716
Puerto-Rico                   0.003501
El-Salvador                   0.003255
India                         0.003071
Cuba                          0.002918
England                       0.002764
Jamaica                       0.002488
South                         0.002457
China                         0.002303
Italy                         0.002242
Dominican-Republic            0.002150
Vietnam                       0.002058
Guatemala                     0.001966
Japan                         0.001904
Poland                        0.001843
Columbia                      0.001812
Taiwan                        0.001566
Haiti                         0.001351
Iran                          0.001321
Portugal                      0.001136
Nicaragua                     0.001044
Peru                          0.000952
France                        0.000891
Greece                        0.000891
Ecuador                       0.000860
Ireland                       0.000737
Hong                          0.000614
Cambodia                      0.000584
Trinadad&Tobago               0.000584
Laos                          0.000553
Thailand                      0.000553
Yugoslavia                    0.000491
Outlying-US(Guam-USVI-etc)    0.000430
Honduras                      0.000399
Hungary                       0.000399
Scotland                      0.000369
Holand-Netherlands            0.000031
Name: native-country, dtype: float64

4. Каковы средние и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary)? *

In [26]:
data[data['salary'].apply(lambda x: x == '>50K')]['age'].mean()

44.24984058155847

In [27]:
data[data['salary'].apply(lambda x: x == '>50K')]['age'].std()

10.51902771985177

5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает менее 50K в год (признак salary)? *

In [31]:
data[data['salary'] == '<=50K']['age'].mean()

36.78373786407767

In [32]:
data[data['salary'] == '<=50K']['age'].std()

14.020088490824813

6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education равен Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate) *

In [38]:
pd.crosstab(data['education'], data['salary'])

salary        <=50K  >50K
education
10th            871    62
11th           1115    60
12th            400    33
1st-4th         162     6
5th-6th         317    16
7th-8th         606    40
9th             487    27
Assoc-acdm      802   265
Assoc-voc      1021   361
Bachelors      3134  2221
Doctorate       107   306
HS-grad        8826  1675
Masters         764   959
Preschool        51     0
Prof-school     153   423
Some-college   5904  1387

In [40]:
pd.crosstab(data[data['salary'] == '>50K']['education'], data[data['salary'] == '>50K']['salary'], normalize=True)

salary            >50K
education
10th          0.007907
11th          0.007652
12th          0.004209
1st-4th       0.000765
5th-6th       0.002041
7th-8th       0.005101
9th           0.003443
Assoc-acdm    0.033797
Assoc-voc     0.046040
Bachelors     0.283255
Doctorate     0.039026
HS-grad       0.213621
Masters       0.122306
Prof-school   0.053947
Some-college  0.176891

7. Каков максимальный возраст мужчин расы Amer-Indian-Eskimo? *

In [41]:
data[data['race'] == 'Amer-Indian-Eskimo'].max()

age                               82
workclass                  State-gov
fnlwgt                        445168
education               Some-college
education-num                     16
marital-status               Widowed
occupation          Transport-moving
relationship                    Wife
race              Amer-Indian-Eskimo
sex                             Male
capital-gain                   27828
capital-loss                    1980
hours-per-week                    84
native-country         United-States
salary                          >50K
dtype: object

8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status для женатых равен Married-civ-spouse, Married-spouse-absent или Married-AF-spouse)? *

In [48]:
pd.crosstab(data[data['sex'] == 'Male']['marital-status'], data[data['sex'] == 'Male']['salary'], normalize=True)

salary                    <=50K      >50K
marital-status
Divorced               0.068242  0.013034
Married-AF-spouse      0.000229  0.000184
Married-civ-spouse     0.338733  0.272510
Married-spouse-absent  0.008720  0.001056
Never-married          0.256586  0.014915
Separated              0.015833  0.002249
Widowed                0.005920  0.001790

In [49]:
data.pivot_table()

ValueError: No group keys passed!

9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много? *

In [52]:
max_hours_per_week = data['hours-per-week'].max()
data[data['hours-per-week'] == max_hours_per_week].count()

age               85
workclass         85
fnlwgt            85
education         85
education-num     85
marital-status    85
occupation        85
relationship      85
race              85
sex               85
capital-gain      85
capital-loss      85
hours-per-week    85
native-country    85
salary            85
dtype: int64

In [55]:
pd.crosstab(data[data['hours-per-week'] == 99]['salary'], data['salary'], normalize=True)

salary     <=50K      >50K
salary
<=50K   0.705882  0.000000
>50K    0.000000  0.294118

10. Каково среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для Японии? *

In [60]:
data.pivot_table(['hours-per-week'], ['native-country','salary'], aggfunc='mean')

                       hours-per-week
native-country salary
?              <=50K        40.164760
               >50K         45.547945
Cambodia       <=50K        41.416667
               >50K         40.000000
Canada         <=50K        37.914634
...                               ...
United-States  >50K         45.505369
Vietnam        <=50K        37.193548
               >50K         39.200000
Yugoslavia     <=50K        41.600000
               >50K         49.500000

[82 rows x 1 columns]

## Результат 10/10